const ar = {
    // SplashScreens
    Darbi:'دربي',
    Description:"تطبيق التوصيل الإفضل في المملكة",
    SplashFirstSentence: 'اختر الكابتن والمكان المناسب لك!',
    SplashSecondSentence :'تصفح واطلع علي جميع الرحلات',
    StartNow:'ابدأ الان',
    
    
    // BottomBar
    
    Home:'الرئيسية',
    MyContracts:'العقود',
    MyTrip:'رحلاتي',
    More:'المزيد',
    Chat:'الدردشة',
    
    //Auth
    DescriptionOfAuth:"إكثر من 5,255 سائق يثق بنا.",
    phoneOrEmailLogin: 'رقم الهاتف او البريد الالكتروني',
    phoneOrEmailSignUp: 'رقم الهاتف او البريد الالكتروني',
    login: 'تسجيل دخول 👋',
    logIn:'تسجيل دخول',
    logInButtom:'تسجيل دخول',
    SignUp:" تسجيل حساب ",
    RegisterNew:'تسجيل حساب جديد',
    Welcome_1:'مرحبا بعودتك ، أضف رقم الهاتف المسجل لدينا مسبقاً أو البريد الألكتروني.',
    Welcome_2:" من فضلك إضف رقم الهاتف أو البريد الالكتروني للتسجيل.",
    RegisterNow:'سجل الان',
    EmailSignUp: 'البريد الالكتروني',
PhoneSignUp: 'رقم الهاتف',
    // OTP
    textOtphead:' ادخال رمز الOTP',
    sendOtpPhone: ' أدخل الرمز الذي أرسلناه إلى رقمك',
    sendOtpEmail: ' ادخل االرمز الذي أرسلناه إلى بريدك الالكتروني',
    modifyMyNumber: "هل تريد تعديل رقمك؟",
    modifyMyEmail: "هل تريد تعديل بريدك الالكتروني؟",
    sendagain: 'ارسال مرة اخري',
    codeNotsend:"  لم يتم ارسال الكود؟", 
    VerifyMass:"تم التحقق",
    
    // PersonalInfo
    ComInfo:"إستكمال البيانات",
    personalInfo:'معلوماتك الشخصية',
    desc:'إضف معلوماتك الإساسية كا راكب في ديربي.',
    addImage:"إضف صورة سيلفي",
    carType:'نوع السيارة',
    IDNumber:`رقم الهوية الوطنية`,
    IDImage:" صورة الهوية الوطنية",
    editIDImage:" تبديل صورة الهوية",
    changeImageProfile:'تغيير الصورة',
    register:"سجل الان",
    Gender:'النوع',
    Man:'رجل',
    Woman:'أنثي',
    Date_of_brith:'تاريخ الميلاد',
    Nationality:'الجنسية',
    nation:'عنوانك ( الرياض - جدة - ...',
    PhoneNumber:'رقم الهاتف',
    // AddCarDetails
    VehicleInfo:' معلومات السيارة',
    Desc:'عظيم، تلك هي الخطوة الإخيرة لدخولك عالم ديربي.',
    addPhoto:'إضف صور' ,
    deletePhoto:'حذف الصورة',
    TypeOfcar:"نوع السيارة",
    CarModel:`موديل السيارة`,
    NumOfseats:`عدد مقاعد السيارة`,
    NumOfseats2:`عدد المقاعد`,

    Type:'اختار نوع السيارة',
Make:'اختار ماركة السيارة',

    NumofPlate  : `رقم اللوحة`,
    licenseImg:' صورة الإستثمارة',
    EnterDarbi:`سجل الإن`,
    
    // MainPage
    totalBalance:'إجمالي الرصيد',
    AvailableBalance:"المتاح للسحب",
    PendgingBalance:"المبلغ المعلق",
    currency:'ر.س',
    yourAdvertisements:`إعلاناتك `,
    showAdv:'شاهد الاعلان',
    AdvStatus:'حالة الإعلان',
    statusAcceptable:'مقبول',
    statusCanceled:'ملغي',
    statusPending:'معلق',
    AddNewAdV:'إضف إعلاني جديد ',
    NoAdv:'  لايوجد لديك إي إعلانات في الوقت الحالي.',
    StartAdd:' إبداء الإن بإضافة إعلان جديد.',
    
    // AddAdvertisement
    
    NewADv:"إضافة إعلان جديد",
    NewAdvDesc:' من خلال الاعلان سيظهر لمستخدمين التطبيق بيانات الاعلان.',
    ChooseTripType:" إختر نوع الرحلة",
    Typeone:"ذهاب",
    TypeTwo:`ذهاب وعودة`,
    textInputone:'نوع الخدمة',
    textInputTwo:"نوع النقل ( تشاركي - خاص )",
    textInputThree:"مدة الاتفاقية",
    textStartpoint:"مكان المغادرة",
    changePlace:'تغيير',
    textDestination:" مكان الوصل",
    AddNotes:'إضف الملاحظات ',
    OtherServices:"خدمات إخري",
    PublishMyAd:'إضف إعلاني الإن ',
    approved:'مقبول',
    rejected:'ملغي',
    in_review:'قيد المراجعة',
    changed_credentials:"تم تغيير بيانات الاعتماد",
    backToTrip:"عودة للرحلات",
HideDetails:"اخفاء التفاصيل",
ShowDetails:"اظهار التفاصيل",
pm:"م",
am:'ص',
TripStatus:"حالة الرحلة",
TripStatusDesc:'رحلة',

    // SelectService
    
    SelectServiceType:'اختر نوع الخدمة',
    ServiceOneTypeOne:'نقل مدرسي',
    ServiceOneTypeTwo:'نقل جامعي',
    ServiceOneTypeThere:'نقل موظفين',
    ServiceOneTypeFour:'الكل',
    
    ServiceTwoTypeOne:'تشاركي',
    ServiceTwoTypeTwo:'خاص',
    ServiceTwoTypeThere:"تشاركي وخاص",
    
ServiceThreeTypeOne:'شهري',
ServiceThreeTypeTwo:'اسبوعي',
ServiceThreeTypeThere:'سنوي',
ServiceThreeTypeFour:'الكل',

    
    OtherServicesOne:"التدخين",
    OtherServicesTwo:"موسيقي",
    OtherServicesThere:"الحيوانات",
    OtherServicesFour:"الإعاقة ",
    
    available:'متاح',
    notAvailable:'غير متاح',
    conFirm:'تأكيد',
    
    
    // ConfirmAdv
    
    AdvDone:'  تم تأكيد إرسال إعلانك لدربي، بنجاح.',
    DoneDesc:' سنقوم بإرسال إشعار عند قبول إعلاناك.',
    GotoHome:'الصفحة الرئيسية',
    
    // Map
    startPointtext:'اختر مكان المغادرة',
    endPointtext:'اختر مكان الوصول',
    sendtartPointText:'تلك هي نطقة الانطلاق',
    senddropoffText:'تلك هي نطقة النزول',
    searchText:'البحث بالعنوان',
    changeLoc:' تغيير',
    startinDrop:'نقطة الانطلاق',
    shareLoaction:'مشاركه موقعك',
    
    // ChatList
    PageName:'المحادثات',
    searchTextChat:'البحث ',
    searchTextFilter:'التوصيل الي',

    
    // Chat Page
    lastSeenNow:'اخر تحديث الان',
    LastUpdatedSeen :"اخر تحديث منذ ",
    oneminute:'دقيقة',
    oneHour:'ساعة',
    oneDay:'يوم',
    TownName:'الرياض',
    noName:'لا يوجد اسم',
noCountry:'لا يوجد بلد',
    ShowContract:'شاهد العقد',
    ShowRiderLoca:'شاهد موقع العميل',
    TypeYourMass:`اكتب رسالتك هنا...`,
    addContart:"اضافة عقد",
    ShareYourLoc:"مشاركة موقعك الحالي",
    ChooseShareLoc:"من فضلك اختر الطريقة التي تريد مشاركة موقعك بها.",
    chooseYorLocOnMap:'اختر موقعك من الخريطة',
    
    dele:'حذف',
    EditLoc:"تعديل",
    // new contract
    formButton:'تكملة الحجز - بدء الآن',
    pagetitel:" اضافة عقد جديد"  ,
    driverName:' اسم السائق',
    riderName:'اسم الراكب',
    amount:' المبلغ المتفق عليه',
    ServiceType:" نوع الخدمة",
    TransportType:"نوع النقل",
    Model: "اختار موديل السيارة",
    countTravelers:"عدد الركاب",
    TimeLeave:'وقت الوصول',
    ArrivalTime:'وقت المغادرة',
    DurationContract: "مدة الاتفاقية",
    EndContract:' نهاية الاتفاق',
    StartingContract:" بداية الاتفاق",
    SendContract:" إرسل العقد",
    successfullyText:'تم ارسال العقد بنجاح!',
    concertMass:'You sent the contract to the rider',
    contractLocMess:'تم مشاركة موقعك الحالي مع السائق, بنجاح',
    SeeContract:'شاهد العقد',
    chooseTripDays:'اختر ايام الرحله',
    daysChosse:"شهريا",
    daysChosse2:"اسوعيا",
    chosseser1model:'اختر نوع الخدمة',
    chosseser2model:'اختر نوع النقل',
    chosseser3model:'اختر نوع الاتفاقية',
    Weekly:'اسبوعيا',
    Monthly:'شهريا',
    Yearly:'سنويا',
    Full:'الكل',
    payNow:'ادفع الان',
    showRes:'مشاهدة النتائج',
    No_more_contracts:' لا يوجد مزيد من العقود',


    // Support Chat

SupportChat:'الدعم والمساعدة',
NoChats:'لا يوجد محادثات',
TechnicalSupport:'الدعم الفني',
ContactUs:'اتصل بنا',   
ContactDesc:'يرجى مشاركة تفاصيلك وسيقوم فريق الدعم لدينا بالرد عليك في أقرب وقت ممكن',
ReadMessages:'قراءة الرسائل',
Tell_us_More:'اخبرنا المزيد',
Tell_us_MoreDesc:'يرجى كتابة تفاصيلك وسيقوم فريق الدعم لدينا بالرد عليك في أقرب وقت ممكن',
Add_More_Details:'اضف المزيد من التفاصيل',
No_more_posts:'لا يوجد مزيد من المنشورات',
No_job_posts:'لا يوجد الوظائف',

    //  contract details
    Contracts:"العقود",
    Duration_Contract:'مدة الاتفاقية',
    Close:'اغلاق',
    Contract_details:"تفاصيل العقد",
    Driver_info:"بيانات السائق",
    Car:'السيارة',
    Main_info:'البيانات الاساسية',
    Number_of_trips:'عدد الرحلات',
    Number_passengers:'Number passengers',
    Transportation_type:"Transportation type",
    Trip_days:'ايام الرحلات',
    Price:"المبلغ",
    Pick_up_point:'نقطة البدايه',
    Drop_point:'نقطة النهاية',
    View_the_map:'شاهد الخريطة',
    You_can_also_view_the:'يمكنك ايضا الاطلاع علي ',
    terms_and_conditions:'الشروط والاحكام',
    atHour:' الساعة',
    availableed:'متوفر',
    notAvailableed:'غير متوفر',
    No_contracts:'لا يوجد عقود لعرضها',
    // Pay now
    
    // pay mob
    
    // Profile pagr :
    
    WalletBalance :"رصيد المحفظة",
    BalanceTotal:"2.500 ر.س",
    Main :"الرئيسة",
    MyTrips :"رحلاتي",
    Settings :"الاعدادات",
    Help :"المساعدة والدعم",
    AddComplaint :"إضافة شكوي",
    Other:'إخري',
    InviteFriends :"قم بدعوة اصدقائك",
    AboutApp :"حول التطبيق",
    Terms :"الشروط والأحكام",
    logOut :"تسجيل الخروج",
    
    
    // page 2
    
    VehicleInformation : 'معلومات السيارة',
    PersonalInformation: 'المعلومات شخصية',
    YourPersonalInformation : 'معلوماتك شخصية ',
    MohamedAlghamidi : ' عادل التهامي',
    LicensePlateNum : '2980756125420',
    EditYourPersonalInfo : 'تعديل معلوماتك الشخصية',
    
    // page 3
    ChangeYourIDPhoto : 'تبديل صورة الهوية',
    ChangePhoto : "تغيير الصورة",
    FinishEditing : 'انهاء التعديل',
    
    
    // Modal
    
    textModal:' تم إرسال تعديلاتك للإدارة.',
    textModal2:' سنقوم بمراجعة تعديلاتك وسنرسل لك اشعار عند التاكيد.',
    Thnx:'انهاء التعديل',
    
    
    // page 4
    
CarName:'اسم السيارة',
thetype:"نوع السيارة",
Seats:'مقاعد',
Modify:'تعديل بيانات سيارتك',


// /
ServicesDetails:'تفاصيل الخدمات',
Driver_Details :'بيانات السائق',
Service_type:"نوع الخدمة",
dropOff_places:'أماكن التوصيل',
Delivery_places:"أماكن النزول",
Vehicle_information:"بيانات السيارة",
Service_details:'تفاصيل الخدمة',
Service_ADV:'تفاصيل الخدمة',
Notes:'الملاحظات',
Delivery_to:'التوصيل الي',
Click_notes:'اضغط لقراءة الملاحظات',
Transport_type:"نوع النقل",
Other_services:"خدمات اخري",
animals:'الحيوانات',
Disability:'الاعاقة',
Music:'الموسيقي',
Smoking:'التدخين',
Vehicle_pictures:'شاهد +4 صور',
TheSeats:'المقاعد',
chatwithsriver:'الدردشة مع السائق',
carphoto:'صور السيارة',
moveamongphotos:'تنقل بين الصور لعرضها بشكل اوضح.',
driverNotes:'ملاحظات السائق',
thisisNotes:'تلك هي الملاحظات الخاصة بالسائق.',
// My Trips
    
    Trips:'رحلات',
    NunofTrips:'عدد الرحلات',
    Coming:'القادمة',
    DoneTrips:'المكتملة',
    CanceledTrips:'الملغاه',
    PostponedTrips:'المؤجلة',
    ComingTrip:'الرحلات القادمة',
    DoneTrip:'الرحلات المكتملة',
    CanceledTrip:'الرحلات الملغاه',
    PostponedTTrip:'الرحلات المؤجلة',
    oneTrip:'رحلة',
    Trip_cancellation:'إلغاء الرحلة',
    Postponing_trip:"تأجيل الرحلة",
    MoadlText:'هل أنت متاكد من أنك تريد إلغاء الرحلة؟',
    CancelText:'إلغاء',
    Yes_Cancel:'نعم, إريد إلغاء الرحلة',
    Coming_trip:"رحلة قادمة",
    done_trip:"رحلة مكتملة",
    postpone_trip:"رحلة مؤجلة",
    cancel_trip:"رحلة ملغاه",
    
    pick_date:'قم بتحديد تاريخ التأجيل',
    pick_time:'قم بتحديد وقت التأجيل',
    MadleDoneText:'تم ارسال الطلب الي السائق بنجاح',
    MassegeOfpostponed:'تم تأجيل الرحلة الي  ',
    
    // MyWallet
    
    Wallet_balance : 'رصيد المحفظة',
    Add_Money : "إضافة الإمول للمحفظة",
    All_transactions : 'كل العمليات',
    Spent:"إموال إنفقتها",
    Added:'إموال إضفتها ',
    Transactions :'عملية',
    You_add:' إضفت ' ,
    Wallet:' للمحفظة .',
    You_spent:' إنفقت ',
    CaptanContractLoss:'عقد كابتن محمد',
    OnMonthlyContract:'علي العقد شهري',
    // Settings
    Setting:'الإعدادت',
    Profile:'الملف الشخصي',
    UpdataYourProfile:'تحديث بياناتك الشخصية',
    DescUpdate:'يمكنك تغيير جميع بياناتك الشخصية',
    Update:'تحديث',
    TheLanguage:'اللغة',
    English:'الانجليزية',
    Arabic:'العربية',

// Notify

Notifications:'الإشعارات',
All_your_notifications:'كل الإشعارات التي تخصك في مكان واحد',
No_notifications:'لا توجد اشعارات',
Today:'اليوم',
Your_ad_ccepted:' تم قبول إعلانك، بنجاح',
Your_ad_Num_accepted:"تم قبول إعلانك رقم ",
Your_ad_rejected:'للإسف، تم رفض إعلانك!!',
Your_ad_Num_rejected:' تم رفض إعلانك ',
Your_trip_rated:' تم تقييم رحلتك',
See_customer_rating:'شاهد تقييم العميل لك٫',
Details:'تفاصيل',
Yesterday:'إمس',
No_notifications_today:'لا توجد اشعارات اليوم',
No_notifications_yest:'لا توجد اشعارات بالامس',

// 
search:'البحث',
lastSearch:'عمليات البحث الأخيرة والشائعة',
NoMessagesYet:'لا توجد رسائل بعد',
NoMessages:'اكتب رسالتك الاولى',
// 

showyourTrips:'شاهد رحلاتك' ,

// Support Chat
"Sunday": "الأحد",
"Monday": "الاثنين",
"Tuesday": "الثلاثاء",
"Wednesday": "الأربعاء",
"Thursday": "الخميس",
"Friday": "الجمعة",
"Saturday": "السبت",
"January": "يناير",
"February": "فبراير",
"March": "مارس",
"April": "إبريل",
"May": "مايو",
"June": "يونيو",
"July": "يوليو",
"August": "أغسطس",
"September": "سبتمبر",
"October": "أكتوبر",
"November": "نوفمبر",


SupportChat:'الدعم والمساعدة',
NoChats:'لا يوجد محادثات',
Ticket_Info:'معلومات التذكرة',
Ticket:'التذكرة',
Send_reply:'ارسال رد',
Send_message:'ارسال الرسالة',
Please_share_reply:'يرجى مشاركة تفاصيلك الإضافية وسيقوم فريق الدعم لدينا بالرد عليك في أقرب وقت ممكن',
Type_Your_Problem :'اكتب مشكلتك هنا!',
boxreplyText:'يرجى كتابة رسالة ...',


// about


aboutaPP:'حول التطبيق',
"aboutApp": "عن دربي",
"appTitle": "مرحباً بك في دربي - تطبيق التوصيل الموثوق",
"appDescription": "دربي هو تطبيق التوصيل الرائد في المملكة العربية السعودية، يقدم خدمات نقل سريعة، موثوقة، ومريحة. سواء كنت بحاجة للوصول إلى وجهتك أو إرسال طرد، دربي هنا لتسهيل حياتك. يوفر تطبيقنا ربطًا مع سائقي محترفين في جميع أنحاء المملكة، مما يضمن توصيلات آمنة وفي الوقت المناسب في كل مرة. ثق بدربي لجميع احتياجات النقل الخاصة بك.",
"learnMore": "تعرف على المزيد",

// Conditions and terms
    
termsAndConditions: "الشروط والأحكام",
generalTitle: "الشروط العامة",
      passengerTitle: "شروط الركاب",
      driverTitle: "شروط السائقين",
      generalCondition1: "يجب على جميع المستخدمين الالتزام بالقوانين واللوائح المحلية.",
      generalCondition2: "أي سوء استخدام للتطبيق سيؤدي إلى تعليق الحساب.",
      generalCondition3: "يجمع التطبيق البيانات لتحسين جودة الخدمة.",
      passengerCondition1: "يجب على الركاب اتباع جميع تعليمات السلامة.",
      passengerCondition2: "يجب إجراء الإلغاءات في غضون 5 دقائق لتجنب الرسوم.",
      passengerCondition3: "يجب على الركاب تقديم تفاصيل دقيقة عن موقع الالتقاط.",
      passengerCondition4: "يجب إكمال الدفع من خلال التطبيق.",
      driverCondition1: "يجب أن يكون لدى السائقين رخصة قيادة سارية.",
      driverCondition2: "يجب تسجيل جميع الرحلات في التطبيق.",
      driverCondition3: "يجب على السائقين الحفاظ على مركبتهم في حالة جيدة.",
      driverCondition4: "يجب على السائقين الامتثال لقوانين المرور المحلية.",


// Rateing

Rate:'مذهل، رحلة ناجحة.',
RateDesc:'قيم الإن خدمة السائق من 5 نجوم.',
Ratenote:'قل شيئا عن الخدمة؟',
RateSend:'إرسل تقييمك',
Refill:'اعادة التعبئة',
Trip_details:'تفاصيل الرحلة',
// 
noTransactions:'لا توجد معلومات لعرضها ',

YourRating:'تقييمك',
RatingModalDatils:'التقيم',
Stars:'رأيك',

"all": "كل العقود",
"pending": "متوقفة مؤقتًا",
"active": "نشط",
"cancelled": "ملغى",
"expired": "منتهى",
on_hold:"قيد الانتظار",
"TripTrack": "مسار الرحلة",
TripTimes:'أوقات الرحلات',
PaidFare:'أجرة متغيرة',
FixedFare:'أجرة ثابتة',
PriceTo:'الي',
PriceFrom:'من',
EnterFixedPrice:'ادخال السعر',
RateContract:'تقييم العقد',



    };
    export default ar;
    